[
  {
      "id": 1,
      "nome": "Tesla Model X",
      "imagem": "/images/modelx-destaque.png",
      "descrição": "Um SUV elétrico de luxo produzido pela Tesla, Inc., lançado em 2015. Caracteriza-se por seu design futurista, incluindo as portas traseiras 'Falcon Wing' e o para-brisa panorâmico. O interior é espaçoso, com capacidade para até sete passageiros e amplo espaço de armazenamento. Destaca-se pela performance impressionante, com aceleração de 0 a 100 km/h em cerca de 2,6 segundos na versão mais potente e uma autonomia que pode ultrapassar 550 km com uma única carga. Equipado com tração nas quatro rodas (AWD) e a conveniência da rede de Superchargers da Tesla, oferece uma experiência de condução superior.",
      "ano": 2015,
      "modelo": "Model X",
      "quilometragem": "15.000 km",
      "motor": "Elétrico",
      "transmissão": "Automático",
      "tipoCombustível": "Elétrico",
      "cor": ["preto", "branco", "vermelho"],
      "preço": "R$ 500.000"
  },
  {
      "id": 2,
      "nome": "Ford Mustang",
      "imagem": "/images/fordMustang.png",
      "descrição": "Um carro esportivo icônico com um design robusto e performance impressionante. Equipado com um motor V8 de 5.0L e transmissão manual, o Mustang GT é conhecido por sua potência e agilidade nas estradas. Ideal para entusiastas de carros que procuram uma experiência de condução emocionante.",
      "ano": 2023,
      "modelo": "Mustang GT",
      "quilometragem": "5.000 km",
      "motor": "5.0L V8",
      "transmissão": "Manual",
      "tipoCombustível": "Gasolina",
      "cor": ["prata", "preto", "vermelho"],
      "preço": "R$ 200.000"
  },
  {
      "id": 3,
      "nome": "Toyota Corolla",
      "imagem": "/images/corolla.png",
      "descrição": "Um sedan confiável e eficiente que oferece conforto e economia. O Toyota Corolla XLE é equipado com um motor 2.0L de 4 cilindros e transmissão automática, ideal para uso diário e viagens longas. Destaca-se pelo seu design elegante e funcionalidade, sendo uma escolha popular entre os consumidores conscientes.",
      "ano": 2022,
      "modelo": "Corolla XLE",
      "quilometragem": "10.000 km",
      "motor": "2.0L 4 cilindros",
      "transmissão": "Automático",
      "tipoCombustível": "Gasolina",
      "cor": ["prata", "preto"],
      "preço": "R$ 100.000"
  }
]
